[
    {
        "title": "To be advised",
        "author": "Prof. Xiaohua Jia",
        "image": "keynote1.jpg",
        "affiliation": "City University of Hong Kong",
        "country": "Hong Kong SAR",
        "biography": "Xiaohua Jia received his BSc (1984) and MEng (1987) from University of Science and Technology of China, and DSc (1991) in Information Science from University of Tokyo. He is currently Chair Professor with Dept of Computer Science at City University of Hong Kong. His research interests include cloud computing and distributed systems, data security and privacy, computer networks and mobile computing. Prof. Jia is an editor of IEEE Trans. on Computers (2021 – present), IEEE Internet of Things (2013-2018), IEEE Trans. on Parallel and Distributed Systems (2006-2009), Journal of World Wide Web, Journal of Combinatorial Optimization, etc. He is the General Chair of ACM MobiHoc 2008, TPC Co-Chair of IEEE GlobeCom 2010 – Ad Hoc and Sensor Networking Symp, Area-Chair of IEEE INFOCOM 2015-2017, Track-Chair of IEEE ICDCS 2019, and General Chair of ACM ICN 2019. He is a Fellow of IEEE (Computer Society) and Distinguished Member of ACM."
    },
    {
        "title": " Towards Autonomous, Precision, and Sustainable Farming",
        "author": "Jie Liu",
        "image": "keynote2.jpg",
        "affiliation": "National Key Lab on Smart Farming Technologies and Systems, China",
        "country": "China",
        "biography": "Jie Liu is the Director of National Key Lab on Smart Farming Technologies and Systems in China. He worked at Xerox PARC and Microsoft from 2001 to 2019. He was a Principal Research Manager at Microsoft Research and a partner of the company. His research interests are AI for IoT, mobile and embedded systems, and energy efficient computing. He was the Steering Committee Chair for CPS-IoT Week, IPSN, and SenSys. He received IEEE TCCPS Distinguished Leadership Award and 7 Best Paper Awards from top conferences. He is an IEEE Fellow and an ACM Distinguished Scientist."
    },
    {
        "title": "To be advised",
        "author": "Prof. Willy Susilo",
        "image": "keynote3.jpg",
        "affiliation": "University of Wollongong",
        "country": "Australia",
        "biography": "Willy Susilo is a Distinguished Professor and Australian Laureate Fellow at the School of Computing and Information Technology, University of Wollongong (UOW). He is a Fellow of several academies: IEEE, IET (Institution of Engineering and Technology) Fellow, ACS (Australian Computer Society), AAIA and AIIA. He is the director of Institute of Cybersecurity and Cryptology (iC2), School of Computing and Information Technology, UOW. Willy is an innovative educator and researcher. Currently, he is the Head of School of Computing and Information Technology at UOW (2015 - now). Prior to this role, he was awarded the prestigious Australian Research Council Future Fellowship in 2009. He was the former Head of School of Computer Science and Software Engineering (2009 - 2010) and the Deputy Director of ICT Research Institute at UOW (2006 - 2008). Willy obtained his PhD from the University of Wollongong in 2001. He has published more than 500 research papers in journals and conference proceedings in cryptography and network security."
    }
]
